{
  "genre": {
    "指定なし": "",
    "教育資料": " 学校の授業やトレーニングのための教育資料を作成します。コードブロックを利用してサンプルコードを出力する。各説明の後は説明した内容の実例を入れる。コンテンツの中盤ではブレイクタイムとして豆知識を織り交ぜる。画像や絵文字、アイコン等を使用し視覚的に興味を引く工夫を行う。図やグラフを表示する際はmarmaid.js形式とする。出典を明記する。セクションごとに理解度を確認する簡単なクイズを作成する。今後の学習ロードマップを作成する。次のレベルに進むための教材を紹介する。",
    "ハンズオン": "特定のテーマに関して、ハンズオン資料を作成します。コードブロックを利用してサンプルコードを出力する。各説明の後は説明した内容の実例を入れる。コンテンツの中盤ではブレイクタイムとして豆知識を織り交ぜる。画像や絵文字、アイコン等を使用し視覚的に興味を引く工夫を行う。図やグラフを表示する際はmarmaid.js形式とする。出典を明記する。セクションごとに理解度を確認する簡単なクイズを作成する。今後の学習ロードマップを作成する。次のレベルに進むための教材を紹介する。",
    "ブログ": "指定されたテーマに関するブログ記事を作成します。",
    "プレゼンテーション": "プレゼンテーション用の資料を作成します。",
    "スピーチ原稿": "プレゼンテーションを行うためのスピーチ原稿を作成します。",
    "テクニカルドキュメント": " ソフトウェアのユーザーガイドや製品仕様書を作成します。",
    "リサーチレポート": "特定の主題についてのリサーチレポートや学術論文を作成します。",
    "旅行ガイド": "観光地や都市に関する旅行ガイドを作成します。",
    "レシピ": "料理のレシピを作成します。",
    "小説・物語": "特定のジャンルやテーマに基づいた創作小説を作成します。",
    "ビジネスプラン": " スタートアップや新しいプロジェクトに関するビジネスプランを作成します。",
    "マーケティング資料": " 新製品やサービスを宣伝するためのマーケティング資料を作成します。",
    "ランディング": "ウェブサイトのランディング文書を作成します。",
    "ソーシャルメディア投稿": " インスタグラム、ツイッター、フェイスブックなどのソーシャルメディア投稿を作成します。",
    "プレスリリース": "新製品やイベントの発表のためのプレスリリースを作成します。",
    "会議・イベント資料": " 会議やイベントのための議題、プログラム、参加者向け資料を作成します。"
  },
  "action": {
    "指定なし": "",
    "評価": "以下の観点で評価する。1. 内容の質:- 主張や論点: 主張が明確に述べられているか、論点が適切に設定されているか。- 根拠: 主張に対する証拠や根拠が適切か、信頼性があるか。- 情報の正確性: 提供される情報が正確で現在のものか。2. 構造と組織:- 構成: 文書が適切に組織されているか、情報が論理的な順序で提示されているか。- 一貫性: 文書全体が一貫した流れで書かれているか。- 明確さ: 各セクションやパラグラフが明確な目的を持っているか。3. スタイルとトーン:- 語彙: 使用される語彙が適切で豊かか。- 文体: 書き方が読者に適しているか、フォーマルまたはインフォーマルなスタイルが適切に使用されているか。- トーン: 文書のトーンがその目的や読者に適しているか。4. 文法とスペル:- 文法: 文法的な誤りがないか。- 綴り: 単語の綴りが正しいか。- 句読点: 句読点が適切に使用されているか。5. 引用:- 引用: 引用が適切に行われ、必要な情報が含まれているか。",
    "要約": "主要なポイントや内容を短い要約に変換します。",
    "検索": "内容に基づいてユーザーの質問に答えます。",
    "改善提案": "内容、文法、構文、スタイルの改善提案を行います。",
    "感情分析": "テキストから感情の傾向を分析します。これは製品レビューやカスタマーフィードバックの分析に有用です。",
    "プラジャリズム検出": "テキストが生成AIによって生成されたものでないかをチェックします。",
    "コード説明": "コードの処理内容について要約し、アクティビティ図をmermaid.js形式で出力します。",
    "コードレビュー・リファクタリング": "コードの品質についてチェックを行いリファクタリング案を提示します。適切に関数分割やクラスへの統合を行います。コメントおよびGoogle Styleのdocstring、型ヒントを付与します。変数名や関数名は1文字などにはせず、内容に準じた名前にします。出力は省略しません。",
    "テスト生成": "コードの言語に合わせて適切なライブラリ等を利用したテストコードを生成します。コードにはテストケースがどういった内容であるかを詳細にコメントとして付与します。"
  }
}
